bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Inc/bl808_cam_misc.h
/** @defgroup  ISP_MISC_CAM_ID_TYPE
 *  @{
 */
#define IS_ISP_MISC_CAM_ID_TYPE(type)                    (((type) == ISP_MISC_CAM_0_ID) || \
                                                          ((type) == ISP_MISC_CAM_1_ID) || \
                                                          ((type) == ISP_MISC_CAM_2_ID) || \
                                                          ((type) == ISP_MISC_CAM_3_ID) || \
                                                          ((type) == ISP_MISC_CAM_4_ID) || \
                                                          ((type) == ISP_MISC_CAM_5_ID) || \
                                                          ((type) == ISP_MISC_CAM_6_ID) || \
                                                          ((type) == ISP_MISC_CAM_7_ID) || \
                                                          ((type) == ISP_MISC_CAM_ID_MAX))

/** @defgroup  ISP_MISC_SCALER_ID_TYPE
 *  @{
 */
#define IS_ISP_MISC_SCALER_ID_TYPE(type)                 (((type) == ISP_MISC_SCALER_0_ID) || \
                                                          ((type) == ISP_MISC_SCALER_1_ID) || \
                                                          ((type) == ISP_MISC_SCALER_2_ID) || \
                                                          ((type) == ISP_MISC_SCALER_3_ID) || \
                                                          ((type) == ISP_MISC_SCALER_ID_MAX))

/** @defgroup  ISP_MISC_TSRC_SOURCE_TYPE
 *  @{
 */
#define IS_ISP_MISC_TSRC_SOURCE_TYPE(type) (((type) == ISP_MISC_TSRC_SOURCE_DVP) || \
                                            ((type) == ISP_MISC_TSRC_SOURCE_CSI))


/** @defgroup  ISP_MISC_OSD_ID_TYPE
 *  @{
 */
#define IS_ISP_MISC_OSD_ID_TYPE(type)                    (((type) == ISP_MISC_OSD_0_ID) || \
                                                          ((type) == ISP_MISC_OSD_1_ID) || \
                                                          ((type) == ISP_MISC_OSD_2_ID) || \
                                                          ((type) == ISP_MISC_OSD_3_ID) || \
                                                          ((type) == ISP_MISC_OSD_ID_MAX))

/** @defgroup  ISP_MISC_ADJUST_ID_TYPE
 *  @{
 */
#define IS_ISP_MISC_ADJUST_ID_TYPE(type)                 (((type) == ISP_MISC_ADJUST_0_ID) || \
                                                          ((type) == ISP_MISC_ADJUST_1_ID) || \
                                                          ((type) == ISP_MISC_ADJUST_2_ID) || \
                                                          ((type) == ISP_MISC_ADJUST_3_ID) || \
                                                          ((type) == ISP_MISC_ADJUST_ID_MAX))

/** @defgroup  ISP_MISC_YUV2RGB_ID_TYPE
 *  @{
 */
#define IS_ISP_MISC_YUV2RGB_ID_TYPE(type)                (((type) == ISP_MISC_YUV2RGB_DISPLAY_ID) || \
                                                          ((type) == ISP_MISC_YUV2RGB_NORMAL_ID) || \
                                                          ((type) == ISP_MISC_YUV2RGB_ID_MAX))

/** @defgroup  ISP_MISC_CAM_INPUT_TYPE
 *  @{
 */
#define IS_ISP_MISC_CAM_INPUT_TYPE(type)                 (((type) == ISP_MISC_CAM_ISP_INPUT) || \
                                                          ((type) == ISP_MISC_CAM_ACTIVE_DVP_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_DEFECT_CORRECT_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_CCM_R_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_CCM_G_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_CCM_B_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_GAMMA_R_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_GAMMA_G_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_NONE_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_BNR_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_NR_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_EE_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_ISP_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_OSD_0_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_OSD_1_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_OSD_2_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_OSD_3_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_SCALER_0_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_SCALER_1_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_SCALER_2_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_SCALER_3_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_ADJUST_0_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_ADJUST_1_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_ADJUST_2_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_ADJUST_3_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_YUV420_0_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_YUV420_1_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_YUV420_2_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_YUV420_3_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_GAMMA_B_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_WDR_Y_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_WDR_U_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_WDR_V_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_YUV2RGB_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_DVP2X_OUTPUT) || \
                                                          ((type) == ISP_MISC_CAM_LSC_OUTPUT))

/** @defgroup  ISP_MISC_SCALER_INPUT_TYPE
 *  @{
 */
#define IS_ISP_MISC_SCALER_INPUT_TYPE(type)              (((type) == ISP_MISC_SCALER_ISP_OUTPUT) || \
                                                          ((type) == ISP_MISC_SCALER_ISP_INPUT) || \
                                                          ((type) == ISP_MISC_SCALER_OSD_0_OUTPUT) || \
                                                          ((type) == ISP_MISC_SCALER_OSD_1_OUTPUT) || \
                                                          ((type) == ISP_MISC_SCALER_OSD_2_OUTPUT) || \
                                                          ((type) == ISP_MISC_SCALER_OSD_3_OUTPUT) || \
                                                          ((type) == ISP_MISC_SCALER_DVP_2X_OUTPUT))

/** @defgroup  ISP_MISC_OSD_INPUT_TYPE
 *  @{
 */
#define IS_ISP_MISC_OSD_INPUT_TYPE(type)                 (((type) == ISP_MISC_OSD_ISP_OUTPUT) || \
                                                          ((type) == ISP_MISC_OSD_ISP_INPUT) || \
                                                          ((type) == ISP_MISC_OSD_SCALER_0_OUTPUT) || \
                                                          ((type) == ISP_MISC_OSD_SCALER_1_OUTPUT) || \
                                                          ((type) == ISP_MISC_OSD_SCALER_2_OUTPUT) || \
                                                          ((type) == ISP_MISC_OSD_SCALER_3_OUTPUT) || \
                                                          ((type) == ISP_MISC_OSD_OSD_0_OUTPUT) || \
                                                          ((type) == ISP_MISC_OSD_DVP_2X_OUTPUT))
/** @defgroup  ISP_MISC_OSD_PB_INPUT_TYPE
 *  @{
 */
#define IS_ISP_MISC_OSD_PB_INPUT_TYPE(type)              (((type) == ISP_MISC_OSD_PB_ISP_OUTPUT) || \
                                                          ((type) == ISP_MISC_OSD_PB_ISP_INPUT))

