bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Inc/bl808_cam_misc.h
/** @defgroup  ISP_MISC_YUV2RGB_INPUT_TYPE
 *  @{
 */
#define IS_ISP_MISC_YUV2RGB_INPUT_TYPE(type)             (((type) == ISP_MISC_YUV2RGB_ISP_OUTPUT) || \
                                                          ((type) == ISP_MISC_YUV2RGB_ISP_INPUT) || \
                                                          ((type) == ISP_MISC_YUV2RGB_OSD_0_OUTPUT) || \
                                                          ((type) == ISP_MISC_YUV2RGB_OSD_1_OUTPUT) || \
                                                          ((type) == ISP_MISC_YUV2RGB_OSD_2_OUTPUT) || \
                                                          ((type) == ISP_MISC_YUV2RGB_OSD_3_OUTPUT) || \
                                                          ((type) == ISP_MISC_YUV2RGB_SCALER_0_OUTPUT) || \
                                                          ((type) == ISP_MISC_YUV2RGB_SCALER_1_OUTPUT) || \
                                                          ((type) == ISP_MISC_YUV2RGB_SCALER_2_OUTPUT) || \
                                                          ((type) == ISP_MISC_YUV2RGB_SCALER_3_OUTPUT))

/** @defgroup  ISP_MISC_BAYER_SHIFT_TYPE
 *  @{
 */
#define IS_ISP_MISC_BAYER_SHIFT_TYPE(type)               (((type) == ISP_MISC_BAYER_SHIFT_LEFT) || \
                                                          ((type) == ISP_MISC_BAYER_SHIFT_RIGHT))

/** @defgroup  ISP_MISC_INT_TYPE
 *  @{
 */
#define IS_ISP_MISC_INT_TYPE(type) (((type) == ISP_MISC_INT_AWB0) ||    \
                                    ((type) == ISP_MISC_INT_AE) ||      \
                                    ((type) == ISP_MISC_INT_WDR) ||     \
                                    ((type) == ISP_MISC_INT_AWB1) ||    \
                                    ((type) == ISP_MISC_INT_OSD_PB) ||  \
                                    ((type) == ISP_MISC_INT_SEOF0) ||   \
                                    ((type) == ISP_MISC_INT_SEOF1) ||   \
                                    ((type) == ISP_MISC_INT_SEOF2) ||   \
                                    ((type) == ISP_MISC_INT_AE_HIST) || \
                                    ((type) == ISP_MISC_INT_AWB2) ||    \
                                    ((type) == ISP_MISC_INT_DISPLAY) || \
                                    ((type) == ISP_MISC_INT_SEOF3) ||   \
                                    ((type) == ISP_MISC_INT_ALL))
/** @defgroup  ISP_MISC_SEOF_SOURCE_TYPE
 *  @{
 */
#define IS_ISP_MISC_SEOF_SOURCE_TYPE(type) (((type) == ISP_MISC_SEOF_VSYNC_SENSOR) ||     \
                                            ((type) == ISP_MISC_SEOF_VSYNC_ISP_ACT) ||    \
                                            ((type) == ISP_MISC_SEOF_VSYNC_ISP_OUT) ||    \
                                            ((type) == ISP_MISC_SEOF_VSYNC_DVP_TSRC) ||    \
                                            ((type) == ISP_MISC_SEOF_DISPLAY_TEST_SRC) || \
                                            ((type) == ISP_MISC_SEOF_DISPLAY_OUTPUT))




/** @defgroup  ISP_MISC_SEOF_EDGE_TYPE
 *  @{
 */
#define IS_ISP_MISC_SEOF_EDGE_TYPE(type)                 (((type) == ISP_MISC_SEOF_VSYNC_NEGEDGE) || \
                                                          ((type) == ISP_MISC_SEOF_VSYNC_POSEDGE))

/** @defgroup  ISP_MISC_DISPLAY_INPUT_TYPE
 *  @{
 */
#define IS_ISP_MISC_DISPLAY_INPUT_TYPE(type)             (((type) == ISP_MISC_DISPLAY_YUV2RGB_OUTPUT) || \
                                                          ((type) == ISP_MISC_DISPLAY_YUV422_OUTPUT))

/*@} end of group ISP_MISC_Public_Constants */

/** @defgroup  ISP_MISC_CROP_ID_TYPE
 *  @{
 */
#define IS_ISP_MISC_CROP_ID_TYPE(type)                   (((type) == ISP_MISC_CROP_0_ID) || \
                                                          ((type) == ISP_MISC_CROP_1_ID) || \
                                                          ((type) == ISP_MISC_CROP_2_ID) || \
                                                          ((type) == ISP_MISC_CROP_3_ID) || \
                                                          ((type) == ISP_MISC_CROP_ID_MAX))

/** @defgroup  DVP_DATA_ORDER_TYPE
 *  @{
 */
#define IS_DVP_DATA_ORDER_TYPE(type)                     (((type) == ISP_MISC_2X_DATA_BYTE_LOWER) || \
                                                          ((type) == ISP_MISC_2X_DATA_BYTE_HIGHER))

/** @defgroup  DVP_ACTIVE_LEVEL_TYPE
 *  @{
 */
#define IS_DVP_ACTIVE_LEVEL_TYPE(type)                   (((type) == ISP_MISC_ACTIVE_HIGH) || \
                                                          ((type) == ISP_MISC_ACTIVE_LOW))
void Display_IRQHandler(void);
void ISP_MISC_Int_Callback_Install(ISP_MISC_INT_Type intType, intCallback_Type *cbFun);
void ISP_MISC_Int_Mask(ISP_MISC_INT_Type intType, BL_Mask_Type intMask);
void ISP_MISC_Int_Clear_1(ISP_MISC_INT_Type intType);
void ISP_MISC_SEOF_Set_Source(ISP_MISC_INT_Type intType, ISP_MISC_SEOF_Source_Type source);
void ISP_MISC_SEOF_Set_Edge(ISP_MISC_INT_Type intType, ISP_MISC_SEOF_Edge_Type edge);
void ISP_Misc_Config(ISP_DVP_BIT_DEPTH_E dvp_bits);
void ISP_DVP2AXI_Set_Src(DVP2AXI_Port_Type dvp2axi, DVP2AXI_Src_Type sel);
void ISP_DVP2AXI_Get_Src(DVP2AXI_Port_Type dvp2axi, DVP2AXI_Src_Type *sel);
void ISP_DVP2AXI_Set_Id_Sel(DVP2AXI_Port_Type dvp2axi, DVP2AXI_ID_E id);
void ISP_DVP2AXI_Get_Id_Sel(DVP2AXI_Port_Type dvp2axi, DVP2AXI_ID_E *id);

void ISP_MISC_TSRC_Source_Select(ISP_MISC_TSRC_Source_Type sourceType);

void ISP_Intr_Ctrl_Init(void);
void ISP_Intr_Ctrl_Set_Src(ISP_SEOF_E seof,ISP_Seof_Intr_Src_Type selection);
void ISP_Intr_Ctrl_Get_Src(ISP_SEOF_E seof, ISP_Seof_Intr_Src_Type *selection);
void ISP_Intr_Clr(ISP_INTR_SEL_E intr_sel);
void ISP_Scaler_Set_State(ISP_Scaler_Type type, BL_Fun_Type state);
void ISP_Scaler_Set_Cfg(ISP_Scaler_Type scaler, ISP_SCALER_CONFIG_S *scaler_conf);
void ISP_Frame_M_to_N(ISP_FRAME_M_TO_N_S *cfg);
void ISP_Frame_Get_M_to_N(ISP_FRAME_M_TO_N_S *cfg);
void ISP_Enable_BL_ISP_Back(void);

void ISP_YUV_Adjust_Init();
void ISP_YUV_Adjust_Set_Cfg(ISP_YUV_Adjust_Type id, ISP_YUV_Adjust_Cfg_Type *cfg);
void ISP_YUV_Adjust_Get_Cfg(ISP_YUV_Adjust_Type id, ISP_YUV_Adjust_Cfg_Type *cfg);
void ISP_YUV_Adjust_Set_State(ISP_YUV_Adjust_Type type, BL_Fun_Type state);
void ISP_YUV_Adjust_Get_State(ISP_YUV_Adjust_Type type, BL_Fun_Type *state);
void ISP_YUV_Adjust_Set_Input(ISP_YUV_Adjust_Type type, ISP_YUV_Adjust_Input input);
void ISP_YUV_Adjust_Get_Input(ISP_YUV_Adjust_Type type, ISP_YUV_Adjust_Input *input);

void ISP_MISC_OSD_Input_Select(ISP_MISC_OSD_ID_Type osdId,ISP_MISC_OSD_Input_Type inputType);
void ISP_MISC_OSD_Get_Input_Select(ISP_MISC_OSD_ID_Type osdId,ISP_MISC_OSD_Input_Type *inputType);
void ISP_MISC_OSD_Pb_Input_Select(ISP_MISC_OSD_PB_Input_Type inputType);
void ISP_MISC_OSD_Pb_Get_Input_Select(ISP_MISC_OSD_PB_Input_Type *inputType);
void ISP_MISC_Bayer_Shift(uint16_t bitEnable,ISP_MISC_Bayer_Shift_Type shiftType,uint8_t bitShift);

void ISP_MISC_Scaler_Init(ISP_MISC_Scaler_ID_Type scalerId,ISP_MISC_Scaler_Cfg_Type* scalerCfg);
void ISP_MISC_Scaler_Get_Cfg(ISP_MISC_Scaler_ID_Type scalerId,ISP_MISC_Scaler_Cfg_Type* scalerCfg);
void ISP_MISC_Scaler_Input_Select(ISP_MISC_Scaler_ID_Type scalerId,ISP_MISC_Scaler_Input_Type inputType);
void ISP_MISC_Scaler_Get_Input_Select(ISP_MISC_Scaler_ID_Type scalerId,ISP_MISC_Scaler_Input_Type *inputType);
void ISP_MISC_Scaler_Enable(ISP_MISC_Scaler_ID_Type scalerId);
void ISP_MISC_Scaler_Disable(ISP_MISC_Scaler_ID_Type scalerId);
void ISP_MISC_Scaler_Get_State(ISP_MISC_Scaler_ID_Type scalerId, BL_Fun_Type *state);
void ISP_MISC_Scaler_Sh_Enable(ISP_MISC_Scaler_ID_Type scalerId);
void ISP_MISC_Scaler_Sh_Disable(ISP_MISC_Scaler_ID_Type scalerId);

void ISP_MISC_YUV2RGB_Init(ISP_MISC_YUV2RGB_ID_Type yuv2rgbId,ISP_MISC_YUV2RGB_Cfg_Type* yuv2rgbCfg);
void ISP_MISC_YUV2RGB_Get_Cfg(ISP_MISC_YUV2RGB_ID_Type yuv2rgbId,ISP_MISC_YUV2RGB_Cfg_Type* yuv2rgbCfg);

void ISP_MISC_CAM_Input_Select(ISP_MISC_CAM_ID_Type camId,ISP_MISC_CAM_Input_Type inputType);

