bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Inc/bl808_cam_misc.h
void ISP_MISC_Display_Init(ISP_MISC_Display_Cfg_Type* displayCfg);
void ISP_MISC_Display_Get_Cfg(ISP_MISC_Display_Cfg_Type* displayCfg);
void ISP_MISC_Display_Set_Clk_Output_Inv(int value);
void ISP_MISC_Display_Get_Clk_Output_Inv(int *value);
void ISP_MISC_Display_RGB2YUV_Set_Cfg(ISP_MISC_RGB2YUV_Cfg_Type* rgb2yuvCfg);
void ISP_MISC_Display_RGB2YUV_Get_Cfg(ISP_MISC_RGB2YUV_Cfg_Type* rgb2yuvCfg);

void ISP_Scaler_Set_Input(ISP_Scaler_Type type, ISP_Scaler_Input input);
void ISP_Scaler_Get_Input(ISP_Scaler_Type type, ISP_Scaler_Input *input);
void ISP_OSD_Set_Input(ISP_OSD_Type type, ISP_OSD_Input input);
void ISP_OSD_Get_Input(ISP_OSD_Type type, ISP_OSD_Input *input);
void ISP_YUV2RGB_Set_Input(ISP_YUV2RGB_Type type, ISP_YUV2RGB_Input input);
void ISP_YUV2RGB_Get_Input(ISP_YUV2RGB_Type type, ISP_YUV2RGB_Input *input);
void ISP_YUV2RGB_Init(ISP_YUV2RGB_Param type);

void ISP_MISC_Crop_Init(ISP_MISC_Crop_ID_Type cropId,ISP_MISC_Crop_Cfg_Type* cropCfg);
void ISP_MISC_Crop_Get_Cfg(ISP_MISC_Crop_ID_Type cropId, ISP_MISC_Crop_Cfg_Type* cropCfg);
void ISP_MISC_Crop_Enable(ISP_MISC_Crop_ID_Type cropId);
void ISP_MISC_Crop_Disable(ISP_MISC_Crop_ID_Type cropId);
void ISP_MISC_Crop_Get_State(ISP_MISC_Crop_ID_Type cropId, BL_Fun_Type *state);
void ISP_MSIC_DVP_2x_Init(DVP_2x_Cfg_Type* dvp2xCfg);
void ISP_MSIC_DVP_2x_Get_Cfg(DVP_2x_Cfg_Type* dvp2xCfg);
void ISP_MSIC_DVP_2x_Enable(void);
void ISP_MSIC_DVP_2x_Disable(void);
void ISP_MSIC_DVP_2x_Get_State(BL_Fun_Type *state);
void ISP_MSIC_Pclk_Force_Set_State(BL_Fun_Type state);
void ISP_MSIC_Pclk_Force_Get_State(BL_Fun_Type *state);
void ISP_MSIC_Cr_De_As_Hsync_Set_State(BL_Fun_Type state);
void ISP_MSIC_Cr_De_As_Hsync_Get_State(BL_Fun_Type *state);
void ISP_MSIC_Dtsrc_Set_Mode(ISP_DTSRC_SRC_E mode);
void ISP_MSIC_Dtsrc_Get_Mode(ISP_DTSRC_SRC_E *mode);

/* DVP reshape */
void ISP_MISC_Reshape_Set_State(BL_Fun_Type state);
void ISP_MISC_Reshape_Get_State(BL_Fun_Type *state);
void ISP_MISC_Reshape_Counter_Clear();
void ISP_MISC_Reshape_Set_Counter(int value);
void ISP_MISC_Reshape_Get_Counter(int *value);
void ISP_MISC_Reshape_Set_HSync_Inv(BL_Fun_Type state);
void ISP_MISC_Reshape_Get_HSync_Inv(BL_Fun_Type *state);
void ISP_MISC_Reshape_Set_VSync_Inv(BL_Fun_Type state);
void ISP_MISC_Reshape_Get_VSync_Inv(BL_Fun_Type *state);

#endif //__BL808_ISP_MISC_H__
